# Цільова змінна
y_column = ['diameter']

# Ознаки
X_columns = ['H', 'albedo', 'e', 'a', 'q', 'i', 'om', 'w', 'ma', 'ad', 'n', 'per', 'per_y', 'moid']

# Колонки для заповнення пропущених значень
# ========================================================================

# Колонки для заміни пропущених значень на 'Unknown'
fillna_unknown_columns = ['name']

# Колонки для видалення через повну відсутність даних
columns_to_drop = ['prefix']

# Колонки для заповнення значенням 'N' (Not hazardous)
fillna_not_hazardous_columns = ['pha']

# Колонки для заповнення медіанним значенням
fillna_median_columns = ['H']

# Колонки для групування за іншими ознаками та заповнення середнім значенням
group_mean_fill_columns = {
    'albedo': ['H'],  # Групувати за `H` та заповнювати середнім значенням
    'moid': ['e', 'a', 'i']  # Групувати за орбітальними параметрами `e`, `a`, `i`
}

# Колонки для обчислення значень на основі формул
computed_columns = {
    'diameter': 'formula',  # Обчислення за формулою з використанням `H` та `albedo`
}

# Колонки, які залишаються із значеннями NaN
keep_na_columns = ['diameter_sigma'] + [f'sigma_{col}' for col in ['e', 'a', 'i', 'om', 'w', 'ma']]

# Загальний підхід
# ========================================================================
# 1. Замінюємо значення в колонках `name` на 'Unknown'.
# 2. Видаляємо колонку `prefix`, оскільки вона не несе корисної інформації.
# 3. Заповнюємо значення в колонці `pha` на 'N'.
# 4. Заповнюємо значення в колонці `H` медіанним значенням.
# 5. Заповнюємо значення в колонках `albedo` та `moid` на основі групування за характеристиками.
# 6. Обчислюємо значення для `diameter` за формулою, якщо `H` та `albedo` доступні.
# 7. Для колонок із похибками залишаємо значення NaN, оскільки їх точне обчислення неможливе.

#=============================================================================================

# Колонки для обробки аномальних значень
outlier_columns = ['H', 'albedo', 'e', 'a', 'q', 'i', 'om', 'w', 'ma', 'ad', 'n', 'per', 'per_y', 'moid']

#=============================================================================================
